wayne-love/sn_esp32/src/main.cpp
}

#pragma endregion

#pragma region MQTT Publish / Subscribe

void mqttPublishStatusString(String s){

  mqttClient.publish(String(mqttBase+"rfResponse").c_str(),s.c_str());

}

void mqttPublishStatus() {

  StaticJsonDocument<1024> json;

  json["watertemperature"] = String(si.getWTMP() / 10) + "." + String(si.getWTMP() % 10); //avoids stupid rounding errors
  json["heatertemperature"] = String(si.getHeaterTemperature() / 10) + "." + String(si.getHeaterTemperature() % 10); //avoids stupid rounding errors
  json["casetemperature"] = String(si.getCaseTemperature()); //avoids stupid rounding errors
  json["voltage"]=String(si.getMainsVoltage());
  json["current"]=String(si.getMainsCurrent() / 10) + "." + String(si.getMainsCurrent() % 10);
  json["power"]=String(si.getPower() / 10) + "." + String(si.getPower() % 10);
  json["heatingactive"]=si.getRB_TP_Heater()? "ON": "OFF";
  json["ozoneactive"]=si.getRB_TP_Ozone()? "ON": "OFF";
  json["totalenergy"]=String(si.getPower_kWh() * 10); // convert to kWh to Wh.
  json["hpambtemp"]=String(si.getHP_Ambient());
  json["hpcondtemp"]=String(si.getHP_Condensor());
  json["temperaturesetpoint"]=String(si.getSTMP() / 10) + "." + String(si.getSTMP() % 10);
  json["heatermode"]=si.HPMPStrings[si.getHPMP()];

  json["pump1"]=si.getRB_TP_Pump1()==0? "OFF" : "ON"; // we're ignoring auto here
  json["pump2"]=si.getRB_TP_Pump2()==0? "OFF" : "ON"; // we're ignoring auto here
  json["pump3"]=si.getRB_TP_Pump3()==0? "OFF" : "ON"; // we're ignoring auto here
  json["pump4"]=si.getRB_TP_Pump4()==0? "OFF" : "ON"; // we're ignoring auto here
  json["pump5"]=si.getRB_TP_Pump5()==0? "OFF" : "ON"; // we're ignoring auto here


  String y=String(year(si.getSpaTime()));
  String m=String(month(si.getSpaTime()));
  if (month(si.getSpaTime())<10) m = "0"+m;
  String d=String(day(si.getSpaTime()));
  if (day(si.getSpaTime())<10) d = "0"+d;
  String h=String(hour(si.getSpaTime()));
  if (hour(si.getSpaTime())<10) h = "0"+h;
  String min=String(minute(si.getSpaTime()));
  if (minute(si.getSpaTime())<10) min = "0"+min;
  String s=String(second(si.getSpaTime()));
  if (second(si.getSpaTime())<10) s = "0"+s;

  json["datetime"]=y+"-"+m+"-"+d+" "+h+":"+min+":"+s;

  json["auxheat"]=si.getHELE()==0? "OFF" : "ON";

  json["status"]=si.getStatus();
  json["lightsspeed"]=si.getLSPDValue();

  json["blower"] = si.getOutlet_Blower()==2? "OFF" : "ON";
  json["blowermode"] = si.getOutlet_Blower()==1? "Ramp" : "Variable";
  json["blowerspeed"] = si.getOutlet_Blower() ==2? "0" : String(si.getVARIValue());

  for (int count = 0; count < sizeof(si.sleepCodeMap); count++){
    if (si.sleepCodeMap[count] == si.getL_1SNZ_DAY())
      json["sleeptimer1state"]=si.sleepStringMap[count];
    if (si.sleepCodeMap[count] == si.getL_2SNZ_DAY())
      json["sleeptimer2state"]=si.sleepStringMap[count];
  }
  json["sleeptimer1begin"]=convertToTime(si.getL_1SNZ_BGN());
  json["sleeptimer1end"]=convertToTime(si.getL_1SNZ_END());
  json["sleeptimer2begin"]=convertToTime(si.getL_2SNZ_BGN());
  json["sleeptimer2end"]=convertToTime(si.getL_2SNZ_END());

  json["spamode"]=si.getMode();

  String output = "";
  serializeJson(json,output);

  mqttClient.publish(mqttStatusTopic.c_str(),output.c_str());

  json.clear();
  json["state"]=si.getRB_TP_Light()? "ON": "OFF";

  json["effect"] = si.colorModeStrings[si.getColorMode()];
  json["brightness"] = int(si.getLBRTValue() * 51);

  // 0 = white, if white, then set the hue and saturation to white so the light displays correctly in HA.
  if (si.getColorMode() == 0) {
    json["color"]["h"] = 0;
    json["color"]["s"] = 0;
  } else {
    int hue = 4;
    for (int count = 0; count < sizeof(si.colorMap); count++){
      if (si.colorMap[count] == si.getCurrClr()) {
        hue = count * 15;
      }
    }
    json["color"]["h"] = hue;
    json["color"]["s"] = 100;
  }
  json["color_mode"] = "hs";

  output = "";
  serializeJson(json,output);

  mqttClient.publish(mqttLightsTopic.c_str(),output.c_str());
}


void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String t = String(topic);

  String p = "";
  for (int x = 0; x < length; x++) {
    p += char(*payload);
    payload++;
  }

  debugD("MQTT subscribe received '%s' with payload '%s'",topic,p.c_str());

  String property = t.substring(t.lastIndexOf("/")+1);

  debugI("Received update for %s to %s",property.c_str(),p.c_str());

  if (property == "temperature") {
    si.setSTMP(int(p.toFloat()*10));
  } else if (property == "heatpumpmode") {
    si.setHPMP(p);
  } else if (property == "pump1") {
    si.setRB_TP_Pump1(p=="OFF"?0:1);
  } else if (property == "pump2") {
    si.setRB_TP_Pump2(p=="OFF"?0:1);
  } else if (property == "pump3") { 
    si.setRB_TP_Pump3(p=="OFF"?0:1);
  } else if (property == "pump4") {
    si.setRB_TP_Pump4(p=="OFF"?0:1);
  } else if (property == "pump5") {
    si.setRB_TP_Pump5(p=="OFF"?0:1);
  } else if (property == "auxheat") {
    si.setHELE(p=="OFF"?0:1);
  } else if (property == "datetime") {
    tmElements_t tm;
    tm.Year=CalendarYrToTm(p.substring(0,4).toInt());
    tm.Month=p.substring(5,7).toInt();
    tm.Day=p.substring(8,10).toInt();
    tm.Hour=p.substring(11,13).toInt();
    tm.Minute=p.substring(14,16).toInt();
    tm.Second=p.substring(17).toInt();
    si.setSpaTime(makeTime(tm));
  } else if (property == "lightsspeed") {
    si.setLSPDValue(p);
  } else if (property == "blower") {
    si.setOutlet_Blower(p=="OFF"?2:0);
  } else if (property == "blowerspeed") {
    if (p=="0") si.setOutlet_Blower(2);
    else si.setVARIValue(p.toInt());
  } else if (property == "blowermode") {
    si.setOutlet_Blower(p=="Variable"?0:1);
  } else if (property == "lights") {
    DynamicJsonDocument json(1024);
    deserializeJson(json, p);
    si.setRB_TP_Light(json["state"]=="ON"?1:0);
    if (json.containsKey("effect")) {
      const char *effect = json["effect"];
      si.setColorMode(String(effect));
    }
    if (json.containsKey("brightness")) {
      byte value = json["brightness"];
      if (value == 255) {
        value = 254;
      }
      value = (value / 51) + 1; // Map from 0 to 254 to 1 to 5
      si.setLBRTValue(value);
    }
    if (json.containsKey("color")) {
      int value = json["color"]["h"];
      si.setCurrClr(si.colorMap[value/15]);
    }
  } else if (property == "sleeptimer1state" || property == "sleeptimer2state") {
    for (int count = 0; count < sizeof(si.sleepStringMap); count++){
      if (si.sleepStringMap[count] == p)
        if (property == "sleeptimer1state")
          si.setL_1SNZ_DAY(si.sleepCodeMap[count]);
        else if (property == "sleeptimer2state")
          si.setL_2SNZ_DAY(si.sleepCodeMap[count]);
    }
  } else if (property == "sleeptimer1begin") {
    si.setL_1SNZ_BGN(convertToInteger(p));
  } else if (property == "sleeptimer1end") {
    si.setL_1SNZ_END(convertToInteger(p));
  } else if (property == "sleeptimer2begin") {
    si.setL_2SNZ_BGN(convertToInteger(p));
  } else if (property == "sleeptimer2end") {
    si.setL_2SNZ_END(convertToInteger(p));
  } else if (property == "spamode") {
    si.setMode(p);
  } else {
    debugE("Unhandled property - %s",property.c_str());
  }
}


#pragma endregion

void setup() {
  pinMode(TRIGGER_PIN, INPUT_PULLUP);

#if !defined(ESP8266)
  Serial.begin(115200);
  Serial.setDebugOutput(true);
#endif

